join_message_groups = [
    {
        "chance": 1,
        "messages": [
            "Зря",
            "Зря.",
        ],
    },
    {
        "chance": 1.0,
        "messages": [
            "Қазақ еліне +{count} компуктер сайнсер",
            "Қазақ еліне +{count} комунер сайтер",
            "Қазақ еліне +{count} компунтер саинсе",
            "Қазақ еліне +{count} компьютер саенсер",
            "Қазақ еліне +{count} комитатор саенсер",
            "Қазақ еліне +{count} компилятор сани",
        ],
    },
    {
        "chance": 1.0,
        "messages": [
            "чек закреп",
            "чекни закреп",
            "чекай закреп",
        ],
    },
]
