join_message_groups = [
    {
        "chance": 0.4,
        "messages": [
            "Зря",
            "Зря.",
        ],
    },
    {
        "chance": 1.0,
        "messages": [
            "Қазақ елине +{count} компуктер сайнсер",
            "Қазақ елине +{count} комунер сайтер",
            "Қазақ елине +{count} компунтер саинсе",
            "Қазақ елине +{count} компьютер саенсер",
            "Қазақ елине +{count} комитатор саенсер",
            "Қазақ елине +{count} компилятор сани",
        ],
    },
    {
        "chance": 1.0,
        "messages": [
            "чек закреп",
            "чекни закреп",
            "чекай закреп",
        ],
    },
]

leave_message_groups = [
    {
        "chance": 1.0,
        "messages": [
            "{user} покинул чат...",
        ],
    },
    {
        "chance": 0.6,
        "messages": [
            "Не зря...",
            "не зря....",
        ],
    },
    {
        "chance": 1.0,
        "messages": [
            "Казак елине -1 компуктер сайнсер",
            "Казак елине -1 комунер сайтер",
            "Казак елине -1 компунтер саинсе",
            "Казак елине -1 компьютер саенсер",
            "Казак елине -1 комитатор саенсер",
            "Казак елине -1 компилятор сани",
        ],
    },
    {
        "chance": 1.0,
        "messages": [
            "they chose to be happy...",
        ],
    },
]
